Autodesk.Revit.DB.ScheduleSortGroupField.FieldId
The ID of the field that the schedule will be sorted or grouped by.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleSortGroupField.#ctor(Autodesk.Revit.DB.ScheduleFieldId,Autodesk.Revit.DB.ScheduleSortOrder)
Creates a new ScheduleSortGroupField.
fieldId:
The ID of the field that the schedule will be sorted or grouped by.
sortOrder:
The sort order, ascending or descending.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleSortGroupField.#ctor(Autodesk.Revit.DB.ScheduleFieldId)
Creates a new ScheduleSortGroupField.
fieldId:
The ID of the field that the schedule will be sorted or grouped by.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013